0_attachments/3_backward-step/1_backward-step/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-50 0   -1)
    (-50 25  -1)
    (0   -25 -1)
    (0   0   -1)
    (0   25  -1)
    (250 -25 -1)
    (250 0   -1)
    (250 25  -1)

    (-50 0   1)
    (-50 25  1)
    (0   -25 1)
    (0   0   1)
    (0   25  1)
    (250 -25 1)
    (250 0   1)
    (250 25  1)
);

blocks
(
    // 1st block
    hex (0 3 4 1 8 11 12 9)
    (20 10 1)
    simpleGrading (1 1 1)

    // 2nd block
    hex (2 5 6 3 10 13 14 11)
    (100 10 1)
    simpleGrading (1 1 1)

    // 3rd block
    hex (3 6 7 4 11 14 15 12)
    (100 10 1)
    simpleGrading (1 1 1)
);

defaultPatch
{
    name    frontAndBackPlanes;
    type    empty;
}
    
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 8 9)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (5 6 14 13)
            (6 7 15 14)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (1 4 12 9)
            (4 7 15 12)
            (0 3 11 8)
            (2 3 11 10)
            (2 5 13 10)
        );
    }
);

// ************************************************************************* //
